app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 0)

  def new
    @book = Book.new
    @subjects = Subject.all
---
SELECT * FROM "subjects"

  def create
    @book = Book.new(params[:books])

      if @book.save
        redirect_to :action => 'list'
      else
        @subjects = Subject.all
---
INSERT INTO "books" ("description", "created_at", "price", "title", "subject_id") VALUES('1111111111', '2021-08-02 07:29:54', 390.0, 'Advance Physics', 1)
SELECT * FROM "subjects"

  def edit
    @book = Book.find(params[:id])
    @subjects = Subject.all
---
SELECT * FROM "books" WHERE ("books"."id" = 1)
SELECT * FROM "subjects"

  def update
    @book = Book.find(params[:id])

   if @book.update_attributes(params[:book])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)
UPDATE "books" SET "subject_id" = 4, "price" = 122.0, "title" = 'Advance Psychology' WHERE "id" = 5

  def delete
    Book.find(params[:id]).destroy
---
DELETE FROM "books" WHERE "id" = 4
SELECT * FROM "books" WHERE ("books"."id" = 4)

  def show_subjects
    @subject = Subject.find(params[:id])
---
SELECT * FROM "subjects" WHERE ("subjects"."id" = 1)